#include <iostream>

using namespace std;
/*
Описать процедуру Minmax(X, Y), записывающую в переменную X минимальное из
значений X и Y, а в переменную Y — максимальное из этих значений (X и Y —
вещественные параметры, являющиеся одновременно входными и выходными).
Используя четыре вызова этой процедуры, найти минимальное и максимальное из
данных чисел A, B, C, D.
 */


void Minmax(float & x, float & y){

    if(x>y){
        x=y;
        y=x;
        std::cout<<"X= "<< x <<"  "<<"Y= "<<y;
    }

    if(x<y){
        x=x;
        y=y;
        std::cout<<"X= "<< x <<"  "<<"Y= "<<y;
    }
}
int main()
{
    float a,b,c,d;
    a=2;
    b=4;
    c=1;
    d=-1;
    Minmax(a,b);
    return 0;
}
