// 9. Сделать конвертер величин. Формат ввода: Направление_Перевода Величина
//  f. Давление (паскаль, бар, фунт на квадратный дюйм)

#include <iostream>

int main()
{
    int I;
    float x;
    setlocale(LC_ALL, "Rus");
    std::cout << "Введите направление перевода" << "\n" << "1-Градусы в кельвина" << "\n" << "2-Градусы в фаренгейты" << "\n" << "3-Кельвина в градусы" << "\n" << "4-Кельвина в Фаренгейты" << "\n" << "5-Фаренгейты в градусы" << "\n" << "6-Фаренгейты в кельвина" << std::endl;
    std::cin >> I;
    std::cout << "Введите число для перевода" << std::endl;
    std::cin >> x;
    if (I == 1) {
        x = x * 273.15;
        std::cout << x << " Кельвина";
    };
    if (I == 2) {
        x = x * 32;
        std::cout << x << "Градусы в фаренгейты";
    };
    if (I == 3) {
        x = x * -273.15;
        std::cout << x << "Кельвина в градусы";
    };
    if (I == 4) {
        x = x * -459.67;
        std::cout << x << "Кельвина в Фаренгейты";
    };
    if (I == 5) {
        x = x * -17.777777777778;
        std::cout << x << "Фаренгейты в градусы";
    };
    if (I == 6) {
        x = x * 255.37222222222;
        std::cout << x << "Фаренгейты в кельвина";
    }
}